Documents/ЗачислениеОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗачислениеОбучающихся</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.АктуальностьКонтингента</xr:Item>
				<xr:Item>AccumulationRegister.ЧисленностьГруппы</xr:Item>
				<xr:Item>AccumulationRegister.АктивныйКонтингент</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Абитуриенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контингент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Группы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗачислениеОбучающихся/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Объект.Проведен Тогда
		Если Объект.Абитуриенты = 0 Тогда
			Сообщить("Необходимо добавить минимум одного абитуриента!");
			Отказ = Истина;
			
		Иначе
			
			СтрокаТабличнойЧасти = Элементы.Абитуриенты.ТекущиеДанные;
			
			Для Каждого СтрокаТабличнойЧасти Из Объект.Абитуриенты Цикл
				Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Группа) Тогда
					Сообщить("Группа не заполнена! Проверьте корректность заполнения документа!");
					Отказ = Истина;
					
				Иначе Отказ = РаботаДокументов.ПроверкаСтудентаВГруппе(СтрокаТабличнойЧасти.ФИО); КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
